interface AffixListItem {
    id:number,
    main: string[];
    sub: string[];
}

let AffixList:AffixListItem[]=[{
    id:1,
    main:["生命值"],
    sub:['生命值%數','攻擊力','攻擊力%數','防禦力','防禦力%數','暴擊率', '暴擊傷害','元素精通','元素充能效率']   
},{
    id:2,
    main:["攻擊力"],
    sub:['生命值','生命值%數','攻擊力%數','防禦力','防禦力%數', '暴擊率', '暴擊傷害','元素精通','元素充能效率']
},{
    id:3,
    main: ["攻擊力%數", "生命值%數", "防禦力%數", '元素精通','元素充能效率'],
    sub:['生命值','生命值%數','攻擊力','攻擊力%數','防禦力','防禦力%數', '暴擊率', '暴擊傷害','元素精通','元素充能效率']
},{
    id:4,
    main: ["攻擊力%數", "生命值%數", "防禦力%數", '元素精通','物理傷害加成','冰屬性傷害加成','火屬性傷害加成','雷屬性傷害加成','岩屬性傷害加成','水屬性傷害加成','草屬性傷害加成','風屬性傷害加成'],
    sub: ['生命值','生命值%數','攻擊力','攻擊力%數','防禦力','防禦力%數','暴擊率', '暴擊傷害','元素精通','元素充能效率']
},{
    id:5,
    main:["攻擊力%數", "生命值%數", "防禦力%數", '元素精通','治療加成','暴擊率', '暴擊傷害'],
    sub:['生命值','生命值%數','攻擊力','攻擊力%數','防禦力','防禦力%數','暴擊率', '暴擊傷害','元素精通','元素充能效率']
},{
    id:6,
    main: [],
    sub:['生命值','生命值%數','攻擊力','攻擊力%數','防禦力','防禦力%數', '暴擊率', '暴擊傷害','元素精通','元素充能效率','治療加成','物理傷害加成','冰屬性傷害加成','火屬性傷害加成','雷屬性傷害加成','岩屬性傷害加成','水屬性傷害加成','草屬性傷害加成','風屬性傷害加成']
}]


export default AffixList;
//每件聖遺物部位可能的主副詞條配置